* DONE Wire Client
  :LOGBOOK:
  CLOCK: [2013-05-23 Thu 17:20]--[2013-05-23 Thu 18:11] =>  0:51
  CLOCK: [2013-05-23 Thu 14:00]--[2013-05-23 Thu 15:56] =>  1:56
  :END:
* DONE Better logging
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 20:19]--[2013-05-25 Sat 20:35] =>  0:16
  CLOCK: [2013-05-25 Sat 19:35]--[2013-05-25 Sat 20:19] =>  0:44
  :END:
  I think only the store is properly logged.  The network bits should
  be as well.
* DONE Store event interface
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 02:12]--[2013-05-26 Sun 02:23] =>  0:11
  CLOCK: [2013-05-25 Sat 22:26]--[2013-05-25 Sat 23:41] =>  1:15
  :END:
  Store should export some sort of event interface.  We need this both
  for the status plugin and for the node adapter.
* DONE Implement Simple.close
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 23:45]--[2013-05-25 Sat 23:53] =>  0:08
  :END:
* DONE Store statistics
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 16:33]--[2013-05-26 Sun 16:47] =>  0:14
  CLOCK: [2013-05-26 Sun 15:05]--[2013-05-26 Sun 15:23] =>  0:18
  CLOCK: [2013-05-26 Sun 14:16]--[2013-05-26 Sun 15:03] =>  0:47
  :END:
  - [X] Event-handler
  - [X] Server
* DONE Monkey
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 21:53]--[2013-05-26 Sun 22:45] =>  0:52
  CLOCK: [2013-05-26 Sun 21:33]--[2013-05-26 Sun 21:45] =>  0:12
  CLOCK: [2013-05-26 Sun 19:43]--[2013-05-26 Sun 20:06] =>  0:23
  :END:
* DONE Status web interface
  :LOGBOOK:
  CLOCK: [2013-05-28 Tue 01:06]--[2013-05-28 Tue 02:18] =>  1:12
  CLOCK: [2013-05-28 Tue 00:54]--[2013-05-28 Tue 01:05] =>  0:11
  CLOCK: [2013-05-28 Tue 00:00]--[2013-05-28 Tue 00:53] =>  0:53
  CLOCK: [2013-05-27 Mon 18:13]--[2013-05-27 Mon 19:02] =>  0:49
  :END:
  - [X] Show log of events
  - [X] Count sets/gets
  - [X] Graph sets/gets
* TODO UDP Connections
  :LOGBOOK:
  CLOCK: [2013-05-23 Thu 13:48]--[2013-05-23 Thu 13:56] =>  0:08
  CLOCK: [2013-05-22 Wed 03:48]--[2013-05-22 Wed 03:58] =>  0:10
  CLOCK: [2013-05-05 Sun 23:13]--[2013-05-05 Sun 23:30] =>  0:17
  CLOCK: [2013-03-22 Fri 13:24]--[2013-03-22 Fri 13:34] =>  0:10
  CLOCK: [2013-03-21 Thu 17:40]--[2013-03-21 Thu 18:22] =>  0:42
  CLOCK: [2013-03-21 Thu 17:30]--[2013-03-21 Thu 17:34] =>  0:04
  :END:
  Nodes should have a set of "neighbor" nodes which they propagate
  updates to, and request updates from.
* TODO Components configuration
  Some way to chose what parts of LTc to start.
* TODO Report outline
  - [ ] General outline
  - [ ] Assessment outline
* TODO Draw DB tip
  - [ ] Keys tip
  - [ ] Values tip
* TODO Pick a nice palette
  ColourLovers to the rescue!
* TODO Prettify events graph
  http://code.shutterstock.com/rickshaw/tutorial/introduction.html
* TODO Smarter
* TODO UDP Maximum Sync
* TODO Better merging
* TODO Multi-entry changes
* TODO Temporal logic formalization
  Figure out what properties the whole thing should have, and what
  properties the individual components should have to be able to prove
  the bigger thing.
* Code improvements
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 02:26]--[2013-05-26 Sun 02:30] =>  0:04
  :END:
